Repository: ElectroCode/Rasserthen
Catalog: plugins/Time/locales/*.po
Languages: it

source: Determines the format string for timestamps. Refer to the Python documentation for the time module to see what formats are accepted. If you set this variable to the empty string, the timestamp will not be shown.
it: Determina il formato per i timestamp. Per sapere quali sono i formati validi fai riferimento alla documentazione di Python per il modulo time. Se si assegna una stringa vuota a questa variabile, il timestamp non verrà mostrato.

source: [<years>y] [<weeks>w] [<days>d] [<hours>h] [<minutes>m] [<seconds>s] Returns the number of seconds in the number of <years>, <weeks>, <days>, <hours>, <minutes>, and <seconds> given. An example usage is "seconds 2h 30m", which would return 9000, which is '3600*2 + 30*60'. Useful for scheduling events at a given number of seconds in the future.
it: [<anni>y] [<settimane>w] [<giorni>d] [<ore>h] [<minuti>m] [<secondi>s] Riporta il numero di secondi equivalenti al numero di <anni>, <settimane>, <giorni>, <ore>, <minuti> e <secondi> specificato. Un esempio di utilizzo è "seconds 2h 30m", che produce 9000, ovvero "3600*2 + 30*60". Utile per pianificare eventi ad un certo numero di secondi nel futuro.

source: <time string> Returns the number of seconds since epoch <time string> is. <time string> can be any number of natural formats; just try something and see if it will work.
it: <tempo> Riporta il numero di secondi di <tempo> a partire dall'epoca (Unix time). <tempo> può essere un qualsiasi numero dei consueti formati; basta provare qualcosa e vedere se funziona.

source: That's right now!
it: È adesso!

source: <time string> Returns the number of seconds until <time string>.
it: <tempo> Riporta il numero di secondi fino a <tempo>.

source: [<seconds since epoch>] Returns the ctime for <seconds since epoch>, or the current ctime if no <seconds since epoch> is given.
it: [<secondi dall'epoca>] Riporta il ctime per <secondi dall'epoca> o, se non specificati, l'attuale ctime (epoca equivale all'Unix time).

source: number of seconds since epoch
it: numero di secondi a partire dall'epoca (Unix time)

source: [<format>] [<seconds since epoch>] Returns the current time in <format> format, or, if <format> is not given, uses the configurable format for the current channel. If no <seconds since epoch> time is given, the current time is used.
it: [<formato>] [<secondi dall'epoca>] Riporta l'attuale orario nel formato <formato>, oppure, se non specificato, utilizza il formato configurabile per l'attuale canale. Se il parametro <secondi dall'epoca> non è specificato, viene utilizzato l'orario attuale (epoca equivale all'Unix time).

source: <seconds> Returns a pretty string that is the amount of time represented by <seconds>.
it: <secondi> Riporta l'ammontare di <secondi> in una stringa ben formattata.

source: <region>/<city> Takes a city and its region, and returns the locale time.
it: <zona>/<città> Prende come argomento una città e la sua zona e restituisce l'ora locale.

source: Python-tz is required by the command, but is not installed on this computer.
it: Il comando richiede Python-tz ma non è installato sul computer.

source: Unknown timezone
it: Fuso orario sconosciuto
