Repository: ElectroCode/Rasserthen
Catalog: plugins/Plugin/locales/*.po
Languages: it

source: This plugin exists to help users manage their plugins. Use 'plugin list' to list the loaded plugins; use 'plugin help' to get the description of a plugin; use the 'plugin' command itself to determine what plugin a command exists in.
it: Questo plugin è per aiutare gli utenti a gestire i loro plugin. Usa "plugin list" per elencare tutti quelli caricati; "plugin help" per ottenere la descrizione di un plugin; lo stesso comando "plugin" per determinare in quale plugin è presente un certo comando.

source: <plugin> Returns a useful description of how to use <plugin>, if the plugin has one.
it: <plugin> Riporta un'utile descrizione di come utilizzare <plugin>, se disponibile.

source: That plugin is loaded, but has no plugin help.
it: Il plugin è caricato ma non ha un help.

source: takes no arguments Returns a list of the currently loaded plugins.
it: non necessita argomenti Riporta un elenco dei plugin attualmente caricati.

source: <command> Returns the name of the plugin that would be used to call <command>. If it is not uniquely determined, returns list of all plugins that contain <command>.
it: <comando> Restituisce il nome del plugin che sarà utilizzato per richiamare <comando>. Se non è unico riporta l'elenco di tutti i plugin che contengono <comando>.

source: plugins
it: plugin

source: The %q command is available in the %L %s.
it: Il comando %q è disponibile nel %L %s.

source: There is no command %q.
it: Non c'è un comando %q.

source: <command> Returns the names of all plugins that contain <command>.
it: <comando> Restituisce i nomi di tutti i plugin che contengono <comando>.

source: <plugin> Returns the author of <plugin>. This is the person you should talk to if you have ideas, suggestions, or other comments about a given plugin.
it: <plugin> Riporta l'autore di <plugin>. È la persona con cui dovresti parlare se hai idee, suggerimenti o altri commenti a proposito del plugin.

source: That plugin does not seem to be loaded.
it: Questo plugin non sembra caricato.

source: That plugin doesn't have an author that claims it.
it: Questo plugin non ha un autore.

source: <plugin> [<nick>] Replies with a list of people who made contributions to a given plugin. If <nick> is specified, that person's specific contributions will be listed. Note: The <nick> is the part inside of the parentheses in the people listing.
it: <plugin> [<nick>] Risponde con un elenco di persone che hanno contribuito al dato plugin. Se <nick> è specificato, verranno elencati i contributi di quella determinata persona. Nota: <nick> è la parte tra parentesi.

source: Take an Authors object, and return only the name and nick values in the format 'First Last (nick)'.
it: Prende l'oggetto Authors e riporta nome e nick nella forma "Nome Cognome (nick)".

source: Take a list of long names and turn it into : shortname[, shortname and shortname].
it: Prende una lista di nomi lunghi e li trasforma in: nomecorto[, nomecorto e nomecorto].

source: Sort the list of 'long names' based on the number of contributions associated with each.
it: Ordina l'elenco di "nomi lunghi" in base al numero di contributi associati a ognuno.

source: Build the list of author + contributors (if any) for the requested plugin.
it: Crea l'elenco di autori + contributori (eventuali) per il plugin richiesto.

source: The %s plugin
it: Il plugin %s

source: has not been claimed by an author
it: non ha alcun autore

source: and
it: e

source: has no contributors listed.
it: non ha contributori elencati.

source: was written by %s
it: è stato scritto da %s

source: %s %h contributed to it.
it: %s %h contribuito.

source: has no additional contributors listed.
it: non ha contributori aggiuntivi elencati.

source: but
it: ma

source: Build the list of contributions (if any) for the requested person for the requested plugin
it: Crea l'elenco di contributi (eventuali) per la persona richiesta nel dato plugin.

source: The nick specified (%s) is not a registered contributor.
it: Il nick specificato (%s) non è un contributore registrato.

source: The %s plugin does not have '%s' listed as a contributor.
it: Il plugin %s non ha "%s" elencato come contributore.

source: command
it: comando

source: the %L %s
it: il %L %s

source: the %L
it: il %L

source: %s wrote the %s plugin and also contributed %L.
it: %s ha scritto il plugin %s e ha contribuito anche a %L.

source: %s contributed %L to the %s plugin.
it: %s ha contribuito a %L per il plugin %s.

source: %s wrote the %s plugin
it: %s ha scritto il plugin %s

source: %s has no listed contributions for the %s plugin.
it: %s non ha contributi elencati per il plugin %s.
