Repository: ElectroCode/Rasserthen
Catalog: plugins/String/locales/*.po
Languages: it

source: Determines the maximum size of a string given to the levenshtein command. The levenshtein command uses an O(m*n) algorithm, which means that with strings of length 256, it can take 1.5 seconds to finish; with strings of length 384, though, it can take 4 seconds to finish, and with strings of much larger lengths, it takes more and more time. Using nested commands, strings can get quite large, hence this variable, to limit the size of arguments passed to the levenshtein command.
it: Determina la dimensione massima di una stringa passata al comando "levenshtein". Quest'ultimo utilizza un algoritmo O(m*n), significa che con stringhe di lunghezza 256, può impiegare 1.5 secondi a terminare; con stringhe lunghe 384, sebbene, impiega 4 secondi e con stringhe più lunghe impiega molto più tempo. Utilizzando comandi nidificati le stringhe possono essere abbastanza grosse; questa variabile esiste per limitare la dimensione degli argomenti passati al comando "levenshtein".

source: <letter> Returns the 8-bit value of <letter>.
it: <lettera> Restituisce il valore 8-bit di <lettera>.

source: <number> Returns the character associated with the 8-bit value <number>
it: <numero> Restituisce il carattere associato al valore 8-bit di <numero>

source: That number doesn't map to an 8-bit character.
it: Questo numero non corrisponde a un carattere 8-bit.

source: <encoding> <text> Returns an encoded form of the given text; the valid encodings are available in the documentation of the Python codecs module: <http://docs.python.org/library/codecs.html#standard-encodings>.
it: <codifica> <testo> Restituisce la forma codificata del testo specificato; le codifiche valide sono disponibili nella documentazione del modulo Python codecs: <http://docs.python.org/library/codecs.html#standard-encodings>.

source: encoding
it: codifica

source: <encoding> <text> Returns an un-encoded form of the given text; the valid encodings are available in the documentation of the Python codecs module: <http://docs.python.org/library/codecs.html#standard-encodings>.
it: <codifica> <testo> Restituisce la forma non codificata del testo specificato; le codifiche valide sono disponibili nella documentazione del modulo Python codecs: <http://docs.python.org/library/codecs.html#standard-encodings>.

source: base64 string
it: stringa base64

source: Base64 strings must be a multiple of 4 in length, padded with '=' if necessary.
it: Le stringhe in base64 devono avere una lunghezza in multipli di 4, circondate da "=" se necessario.

source: <string1> <string2> Returns the levenshtein distance (also known as the "edit distance" between <string1> and <string2>)
it: <stringa1> <stringa2> Riporta la distanza levenshtein (anche conosciuta come "distanza di modifica" tra <stringa1> e <stringa2>)

source: Levenshtein distance is a complicated algorithm, try it with some smaller inputs.
it: La distanza levenshtein è un algoritmo complesso, prova a inserire meno dati.

source: <string> [<length>] Returns the Soundex hash to a given length. The length defaults to 4, since that's the standard length for a soundex hash. For unlimited length, use 0.
it: <stringa> [<lunghezza>] Restituisce l'hash Soundex alla lunghezza specificata. In modo predefinito è impostata a 4, giacché è la lunghezza standard per questo tipo di hash. Per lunghezze illimitate usa 0.

source: <text> Returns the length of <text>.
it: <testo> Riporta la lunghezza di <testo>.

source: <regexp> <text> If <regexp> is of the form m/regexp/flags, returns the portion of <text> that matches the regexp. If <regexp> is of the form s/regexp/replacement/flags, returns the result of applying such a regexp to <text>.
it: <regexp> <testo> Se <regexp> è nella forma m/regexp/flags, restituisce la porzione di <testo> che corrisponde alla regexp. Se non lo è, restituisce il risultato dell'applicare la regexp a <testo>.

source: You probably don't want to match the empty string.
it: È probabile che tu non voglia confrontare una stringa vuota.

source: <password> <text> Returns <text> XOR-encrypted with <password>. See http://www.yoe.org/developer/xor.html for information about XOR encryption.
it: <password> <testo> Restituisce <testo> cifrato con XOR con <password>. Vedi http://www.yoe.org/developer/xor.html per informazioni sulla cifratura XOR.

source: <text> Returns the md5 hash of a given string. Read http://www.rsasecurity.com/rsalabs/faq/3-6-6.html for more information about md5.
it: <testo> Restituisce l'hash md5 di una data stringa. Vedi http://www.rsasecurity.com/rsalabs/faq/3-6-6.html per ulteriori informazioni su md5.

source: <text> Returns the SHA hash of a given string. Read http://www.secure-hash-algorithm-md5-sha-1.co.uk/ for more information about SHA.
it: <testo> Restituisce l'hash SHA di una data stringa. Vedi http://www.secure-hash-algorithm-md5-sha-1.co.uk/ per ulteriori informazioni su SHA.
