Repository: ElectroCode/Rasserthen
Catalog: plugins/Math/locales/*.po
Languages: fr

source: <fromBase> [<toBase>] <number> Converts <number> from base <fromBase> to base <toBase>. If <toBase> is left out, it converts to decimal.
fr: <base 1> [<base 2>] <nombre> Converti le nombre d'une base à l'autre. La seconde base est la décimale par défaut.

source: Invalid <number> for base %s: %s
fr: Nombre invalide pour la base %s : %s

source: Convert a decimal number to another base; returns a string.
fr: Converti un nombre décimal dans une autre base, retourne une chaîne.

source: Convert a number from any base, 2 through 36, to any other base, 2 through 36. Returns a string.
fr: Convertir un nombre de n'importe quelle base, de 2 à 36, à n'importe quelle base, de 2 à 36.

source: <math expression> Returns the value of the evaluated <math expression>. The syntax is Python syntax; the type of arithmetic is floating point. Floating point arithmetic is used in order to prevent a user from being able to crash to the bot with something like '10**10**10**10'. One consequence is that large values such as '10**24' might not be exact.
fr: <expression mathématique> Retourne la valeur de l'<expression mathématique> évaluée. La syntaxe est celle de Python ; le calcul est à virgule flottante. Les calculs à virgule flottante sont utilisés pour enmpêcher l'utilisateur de faire crasher le bot avec quelque chose du genre '10**10**10**10'. L'une des conséquences est que les grandes valeurs commandes '10**24' peuvent ne pas être exactes.

source: There's no reason you should have fancy non-ASCII characters in your mathematical expression. Please remove them.
fr: Il n'y a aucune réelle raison que vous mettiez des caractères non-ASCII dans vos expressions mathématiques. Merci de les retirer.

source: There's really no reason why you should have underscores or brackets in your mathematical expression. Please remove them.
fr: Il n'y a aucune réelle raison que vous mettiez des underscores ou des crochets dans vos expressions mathématiques. Merci de les retirer.

source: You can't use lambda in this command.
fr: Vous ne pouvez utiliser lambda dans cette commande.

source: The answer exceeded %s or so.
fr: La réponse dépasse %s.

source: Something in there wasn't a valid number.
fr: Quelque chose là-dedans n'est pas un nombre valide

source: %s is not a defined function.
fr: %s n'est pas une fonction définie

source: <math expression> This is the same as the calc command except that it allows integer math, and can thus cause the bot to suck up CPU. Hence it requires the 'trusted' capability to use.
fr: <expression mathématique> Cette commande est la même que la commande 'calc', excepté qu'elle utilise des mathématiques entières, ce qui peut causer une surconsommation de CPU de la part du bot. C'est pourquoi elle requiert la capacité 'trusted'.

source: <rpn math expression> Returns the value of an RPN expression.
fr: <expression mathématique NPI> Retourne la valeur de l'expression mathématique NPI.

source: Not enough arguments for %s
fr: Pas assez d'arguments pour %s.

source: %q is not a defined function.
fr: %q n'est pas une fonction définie.

source: Stack: [%s]
fr: Pile : [%s]

source: [<number>] <unit> to <other unit> Converts from <unit> to <other unit>. If number isn't given, it defaults to 1. For unit information, see 'units' command.
fr: [<nombre>] <unité> to <autre unité> Convertit de l'<unité> à l'<autre unité>. Si le nombre n'est pas donné, il vaut 1 par défaut. Pour plus d'informations sur les unités, utilisez la commande 'units'.

source: [<type>] With no arguments, returns a list of measurement types, which can be passed as arguments. When called with a type as an argument, returns the units of that type.
fr: [<type>] Sans argument, retourne la liste des types de mesures, qui peuvent être passés en argument. Lors de l'appel avec un argument, retourne les unités de chaque type.
