Repository: ElectroCode/Rasserthen
Catalog: plugins/Anonymous/locales/*.po
Languages: es, it

source: Determines whether the bot should require people trying to use this plugin to be in the channel they wish to anonymously send to.
es: Determina si el robot debe requerir la gente tratando de utilizar este plugin para poder estar en el canal que desean enviar anónimamente.
it: Determina se il bot richieda che gli utenti siano in canale per inviare messaggi in forma anonima.

source: Determines whether the bot should require people trying to use this plugin to be registered.
es: Determina si el bot debe exigir personas que tratan de utilizar este plugin para ser registrados.
it: Determina se il bot richieda che gli utenti siano registrati per usare il plugin.

source: Determines what capability (if any) the bot should require people trying to use this plugin to have.
es: Determina lo que la capacidad (si lo hay) que el bot debe requieren que las personas tratando de usar este plugin para poder tener.
it: Determina quali capacità (eventuali) debbano avere gli utenti per utilizzare questo plugin.

source: Determines whether the bot will allow the "tell" command to be used. If true, the bot will allow the "tell" command to send private messages to other users.
es: Determina si el bot permitirá al Comando "decirle" a utilizar. De ser cierto, el bot le permitirá al "decir" comando para enviar mensajes privados a otros usuarios.

source: This plugin allows users to act through the bot anonymously. The 'do' command has the bot perform an anonymous action in a given channel, and the 'say' command allows other people to speak through the bot. Since this can be fairly well abused, you might want to set supybot.plugins.Anonymous.requireCapability so only users with that capability can use this plugin. For extra security, you can require that the user be *in* the channel they are trying to address anonymously with supybot.plugins.Anonymous.requirePresenceInChannel, or you can require that the user be registered by setting supybot.plugins.Anonymous.requireRegistration.
es: Este plugin permite a los usuarios actúan a través de la bot anónima. El "hacer" comando tiene el robot realice una acción anónimo en un canal determinado, y el 'dicen' comando permite que otras personas hablan a través de la bot. Desde esto puede ser bastante maltratado, es posible que desee establecer supybot.plugins.Anonymous.requireCapability tan sólo los usuarios con que capacidad puede utilizar este plugin. Para mayor seguridad, se puede requerir que el usuario ser * en * el canal que están tratando de hacer frente de forma anónima con supybot.plugins.Anonymous.requirePresenceInChannel, o puede requerir que el usuario se ha registrado mediante el establecimiento de supybot.plugins.Anonymous.requireRegistration.
it: Questo plugin permette agli utenti di agire attraverso il bot in modo anonimo. Il comando "do" esegue un'azione anonima in un dato canale, mentre "say" permette di parlare tramite il bot. Giacché si può facilmente abusarne, è possibile impostare supybot.plugins.Anonymous.requireCapability in modo che solo gli utenti con determinate capacità possano usare il plugin. Per una maggiore sicurezza è ppossibile richiedere con supybot.plugins.Anonymous.requirePresenceInChannel che l'utente intenzionato a parlare anonimamente sia in canale; o anche, tramite supybot.plugins.Anonymous.requireRegistration, che l'utente sia registrato.

source: You must be in %s to %q in there.
es: Usted debe estar en% s para% q allí.
it: Devi essere in %s per %q.

source: I'm lobotomized in %s.
es: Estoy lobotomizado en%s.
it: In %s sono lobotomizzato.

source: That channel has set its capabilities so as to disallow the use of this plugin.
es: Ese canal ha puesto sus capacidades a fin de no permitir el uso de este plugin.
it: Questo canale ha le capacità impostate in modo da impedire l'utilizzo di questo plugin.

source: This command is disabled (supybot.plugins.Anonymous.allowPrivateTarget is False).
es: Este comando está desactivado (supybot.plugins.Anonymous.allowPrivateTarget es falso).

source: <channel> <text> Sends <text> to <channel>.
es: <Canal> <texto> Envía <texto> al <canal>.

source: <nick> <text> Sends <text> to <nick>. Can only be used if supybot.plugins.Anonymous.allowPrivateTarget is True.
es: <Nick> <texto> Envía <texto> a <nick>. Sólo puede utilizarse si supybot.plugins.Anonymous.allowPrivateTarget es True.

source: <channel> <action> Performs <action> in <channel>.
es: <Canal> <acción> Realiza <action> en <channel>.
it: <canale> <azione> Esegue <azione> in <canale>.

source: Determines whether the bot will require targets of the "say" command to be public (i.e., channels). If this is True, the bot will allow people to use the "say" command to send private messages to other users.
it: Determina se il bot richiederà che le destinazioni del comando "say" siano pubbliche (ovvero i canali). Se impostato a True, il bot permetterà di usare il comando "say" per inviare messaggi privati ad altri utenti.

source: %q cannot be used to send private messages.
it: %q non può essere usato per inviare messaggi privati.

source: <channel|nick> <text> Sends <text> to <channel|nick>. Can only send to <nick> if supybot.plugins.Anonymous.allowPrivateTarget is True.
it: <canale|nick> <testo> Invia <testo> a <canale|nick>. Può solo inviare a <nick> se supybot.plugins.Anonymous.allowPrivateTarget è impostato a True.
