Repository: ElectroCode/Rasserthen
Catalog: plugins/Admin/locales/*.po
Languages: es

source: This plugin provides access to administrative commands, such as adding capabilities, managing ignore lists, and joining channels. This is a core Supybot plugin that should not be removed!
es: Este plugin proporciona acceso a los comandos de administración, tales como la adición de capacidades, la gestión ignoran listas y canales de unión. Se trata de un complemento del núcleo Supybot que no se debe quitar!

source: Nick/channel temporarily unavailable.
es: Nick/canal disponible temporalmente.

source: Cannot join %s, it's full.
es: No puede unirse a %s, está lleno.

source: Cannot join %s, I was not invited.
es: No puede unirse a %s, no me invitaron.

source: Cannot join %s, I am banned.
es: No pudo unirse a %s, estoy baneado.

source: Cannot join %s, my keyword was wrong.
es: No puede unirse a %s, mi palabra estaba mal.

source: Cannot join %s, I'm not identified with NickServ.
es: No puede unirse a %s, yo no estoy identificado con NickServ.

source: <channel> [<key>] Tell the bot to join the given channel. If <key> is given, it is used when attempting to join the channel.
es: <Canal> [<key>] Dígale al bot para unirse al canal dado. Si <key> se da, que se utiliza al intentar entrar al canal.

source: I'm already too close to maximum number of channels for this network.
es: Ya estoy demasiado cerca de número máximo de canales para esta red.

source: takes no arguments Returns the channels the bot is on. Must be given in private, in order to protect the secrecy of secret channels.
es: no tiene argumentos Devuelve los canales del bot está encendido. Debe ser dado en privado, con el fin para proteger el secreto de canales secretos.

source: I'm not currently in any channels.
es: No estoy actualmente en ningún canal.

source: My connection is restricted, I can't change nicks.
es: Mi conexión es restringida, no puedo cambiar nicks.

source: Someone else is already using that nick.
es: Alguien más ya está utilizando ese nick.

source: I can't change nick, I'm currently banned in %s.
es: No puedo cambiar de nick, actualmente Estoy prohibido en %s.

source: I can't change nicks, the server said %q.
es: No puedo cambiar de nicks, dijo el servidor %q.

source: [<nick>] [<network>] Changes the bot's nick to <nick>. If no nick is given, returns the bot's current nick.
es: [<nick>] [<red>] Cambia el nick del bot a <nick>. Si no se da nick, devuelve el actual nick del bot.

source: [<channel>] [<reason>] Tells the bot to part the list of channels you give it. <channel> is only necessary if you want the bot to part a channel other than the current channel. If <reason> is specified, use it as the part message.
es: [<canal>] [<razón>] Le dice al bot a parte de la lista de canales que le des. <canal> es sólo es necesario si desea que el bot a desprenderse de un canal que no sea el canal actual. Si <razón> se especifica, lo utilizan como parte mensaje.

source: I'm not in %s.
es: No estoy en %s.

source: <name|hostmask> <capability> Gives the user specified by <name> (or the user to whom <hostmask> currently maps) the specified capability <capability>
es: <nombre | hostmask> <capacidad> Le da al usuario especificado por <nombre> (o el usuario a quien <hostmask> Actualmente los mapas) la capacidad especificada <capacidad>

source: The "owner" capability can't be added in the bot. Use the supybot-adduser program (or edit the users.conf file yourself) to add an owner capability.
es: La capacidad de "propietario" no se puede añadir en el bot. Utilice el programa de usuario Supybot-add (o editar el users.conf archivo usted mismo) para añadir una capacidad de propietario.

source: You can't add capabilities you don't have.
es: No se puede agregar capacidades que usted no tiene.

source: <name|hostmask> <capability> Takes from the user specified by <name> (or the user to whom <hostmask> currently maps) the specified capability <capability>
es: <Nombre | hostmask> <capacidad> Toma del usuario especificado por <nombre> (o el usuario a quien <Hostmask> Actualmente los mapas) la capacidad especificada <capacidad>

source: That user doesn't have that capability.
es: Ese usuario no tiene esa capacidad.

source: You can't remove capabilities you don't have.
es: No se puede quitar capacidades que usted no tiene.

source: <hostmask|nick> [<expires>] This will set a persistent ignore on <hostmask> or the hostmask currently associated with <nick>. <expires> is an optional argument specifying when (in "seconds from now") the ignore will expire; if it isn't given, the ignore will never automatically expire.
es: <Hostmask | nick> [<expira>] Esto establecerá una persistente ignoran en <hostmask> o la hostmask actualmente asociados con <nick>. <Expira> es un argumento opcional especificar cuándo (en "segundo a partir de ahora") expirará el ignorar; si no se le da, el ignorar nunca expirará automáticamente.

source: <hostmask|nick> This will remove the persistent ignore on <hostmask> or the hostmask currently associated with <nick>.
es: <Hostmask | nick> Esto eliminará la persistente ignoran en <hostmask> o la hostmask actualmente asociada con <nick>.

source: %s wasn't in the ignores database.
es: %S no estaba en la base de datos ignorados.

source: takes no arguments Lists the hostmasks that the bot is ignoring.
es: no tiene argumentos Enumera los sus hosts que el bot está ignorando.

source: I'm not currently globally ignoring anyone.
es: No estoy actualmente haciendo caso omiso a nivel mundial a nadie.

source: takes no arguments Clears the current send queue for this network.
es: no tiene argumentos Borra la cola de envío actual de esta red.
