Repository: ElectroCode/Rasserthen
Catalog: plugins/Format/locales/*.po
Languages: it

source: <text> Returns <text> bolded.
it: <testo> Restituisce <testo> in grassetto.

source: <text> Returns <text> in reverse-video.
it: <testo> Restituisce <testo> in negativo.

source: <text> Returns <text> underlined.
it: <testo> Restituisce <testo> sottolineato.

source: <foreground> [<background>] <text> Returns <text> with foreground color <foreground> and background color <background> (if given)
it: <primo piano> [<sfondo>] <testo> Restituisce <testo> con colore di <primo piano> e colore di <sfondo> (se specificato)

source: <separator> <string 1> [<string> ...] Joins all the arguments together with <separator>.
it: <separatore> <stringa 1> [<stringa> ...] Unisce tutti gli argomenti con <separatore>.

source: <chars to translate> <chars to replace those with> <text> Replaces <chars to translate> with <chars to replace those with> in <text>. The first and second arguments must necessarily be the same length.
it: <caratteri da sostituire> <caratteri di sostituzione> <testo> Sostituisce <caratteri da sostituire> con <caratteri di sostituzione> in <testo>. Il primo e il secondo argomento devono essere obbligatoriamente della stessa lunghezza.

source: <chars to translate> must be the same length as <chars to replace those with>.
it: <caratteri da sostituire> deve essere della stessa lunghezza di <caratteri di sostituzione>.

source: <substring to translate> <substring to replace it with> <text> Replaces all non-overlapping occurrences of <substring to translate> with <substring to replace it with> in <text>.
it: <sottostringa da sostituire> <sottostringa di sostituzione> <testo> Sostituisce tutte le occorrenze di <sottostringa da sostituire> (a condizione che non entrino in conflitto) con <sottostringa di sostituzione> in <testo>.

source: <text> Returns <text> uppercased.
it: <testo> Restituisce <testo> tutto maiuscolo.

source: <text> Returns <text> lowercased.
it: <testo> Restituisce <testo> minuscolo.

source: <text> Returns <text> capitalized.
it: <testo> Restituisce <testo> maiuscolo.

source: <text> Returns <text> titlecased.
it: <testo> Restituisce <testo> con tutte le prime lettere delle parole in maiuscolo.

source: <text> Returns <text> surrounded by double quotes.
it: <testo> Restituisce <testo> tra virgolette doppie.

source: <string 1> <string 2> Concatenates two strings. Do keep in mind that this is *not* the same thing as join "", since if <string 2> contains spaces, they won't be removed by concat.
it: <stringa 1> <stringa 2> Concatena due stringhe. Nota che non è come unire con "", dal momento che se <stringa 2> contiene spazi questi non verranno rimossi da concat.

source: <size> <text> Cuts <text> down to <size> by chopping off the rightmost characters in excess of <size>. If <size> is a negative number, it chops that many characters off the end of <text>.
it: <dimensione> <testo> Taglia <testo> a <dimensione> rimuovendo i caratteri in eccesso più a destra di <dimensione>. Se <dimensione> è un numero negativo, rimuove i caratteri alla fine di <testo>.

source: <number> <text> Returns the <number>th space-separated field of <text>. I.e., if text is "foo bar baz" and <number> is 2, "bar" is returned.
it: <numero> <testo> Riporta i campi (separati da spazi) <numero> di <testo>. Ovvero se il testo è "foo bar baz" e <numero> è 2, verrà mostrato "bar".

source: <format string> [<arg> ...] Expands a Python-style format string using the remaining args. Just be sure always to use %s, not %d or %f or whatever, because all the args are strings.
it: <formato stringa> [<argomento> ...] Espande un formato di stringa in stile Python utilizzando gli argomenti restanti. Assicurati di usare sempre %s, non %d o %f o altro, in quanto tutti gli argomenti sono stringhe.

source: Not enough arguments for the format string.
it: Argomenti non sufficienti per il formato della stringa.
