Repository: ElectroCode/Rasserthen
Catalog: plugins/Alias/locales/*.po
Languages: es

source: Returns the channel the msg came over or the channel given in args. If the channel was given in args, args is modified (the channel is removed).
es: Devuelve el msg del canal vino o el canal dado en args. Si el canal se le dio en args, args es modificado (el canal está eliminado).

source: Encodes [a-z0-9.]+ into [a-z][a-z0-9]. Format: a<number of escaped chars>a(<index>d)+<word without dots>.
es: Codifica [a-z0-9.] + En [az] [a-z0-9]. Formato: un <número de caracteres escapados> a (<índice> d) + <palabra sin puntos>.

source: at least
es: al menos

source: <an alias,%s %n> Alias for %q.
es: <Un alias,%s %n> Alias ​​para %q.

source: argument
es: argumento

source: This plugin allows users to define aliases to commands and combinations of commands (via nesting).
es: Este plugin permite a los usuarios definir los alias de comandos y combinaciones de comandos (a través de anidación).

source: <alias> Locks an alias so that no one else can change it.
es: <Alias> Bloquea un alias para que nadie más puede cambiarlo. Hay saltos de línea aquí. Cada uno

source: There is no such alias.
es: No hay tal alias.

source: <alias> Unlocks an alias so that people can define new aliases over it.
es: <Alias> Desbloquea un alias para que las personas puedan definir nuevos alias sobre él.

source: That name isn't valid. Try %q instead.
es: Ese nombre no es válido. Trate% q en vez.

source: <name> <command> Defines an alias <name> that executes <command>. The <command> should be in the standard "command argument [nestedcommand argument]" arguments to the alias; they'll be filled with the first, second, etc. arguments. $1, $2, etc. can be used for required arguments. @1, @2, etc. can be used for optional arguments. $* simply means "all remaining arguments," and cannot be combined with optional arguments.
es: <Nombre> <comando> Define un alias <nombre> que ejecuta <command>. El <comando> debe estar en el estándar "argumento de comando [argumento nestedcommand]" argumentos al alias; que van a ser llenados con el primero, segundo, etc. argumentos. $ 1, $ 2, etc. puede ser usado para los argumentos necesarios. @ 1, @ 2, etc. puede ser utilizado para argumentos opcionales. $ * Simplemente significa "todo restantes argumentos, "y no puede ser combinado con argumentos opcionales.

source: <name> Removes the given alias, if unlocked.
es: <Nombre> Elimina los alias dados, si desbloqueado.
