Repository: ElectroCode/Rasserthen
Catalog: plugins/Factoids/locales/*.po
Languages: fr

source: Value must include $value, otherwise the factoid's value would be left out.
fr: La valeur doit inclure $value, sinon la valeur de la factoid ne serait pas affichée.

source: Determines whether the Factoids plugins will be browsable on the HTTP server.
fr: Détermine si le plugin Factoids sera accessible par le serveur HTTP.

source: Determines whether factoids can be displayed via the web server.
fr: Détermine si les factoids seront affichées via le serveur web.

source: Only allows a user with voice or above on a channel to use the command.
fr: Autoriser uniquement un(e) utilisateur(trice) qui a un voice ou mieux dans le salon à utiliser la commande.

source: Determines what separator must be used in the learn command. Defaults to 'as' -- learn <key> as <value>. Users might feel more comfortable with 'is' or something else, so it's configurable.
fr: Détermine quel séparateur est utilisé par la commande 'learn'. Par défaut, il s'agit de 'est' : 'learn <clef> as <valeur>. Les utilisateurs sont susceptibles de trouver 'is' plus confortable, ou n'importe quoi, c'est configurable.

source: Determines whether the bot will reply with the single matching factoid if only one factoid matches when using the search command.
fr: Détermine si le bot répondra avec une seule factoid, même si la recherche de l'utilisateur donne plusieurs résultats.

source: Determines whether the bot will reply to invalid commands by searching for a factoid; basically making the whatis unnecessary when you want all factoids for a given key.
fr: Détermine si le bot répondra aux commandes invalides lors de la recherche d'une factoid ; permet simplement de rendre la commande 'whatis' inutile lorsque vous voulez toutes les factoids d'un clef donnée.

source: If you try to look up a nonexistent factoid, this setting make the bot try to find some possible matching keys through several approximate matching algorithms and return a list of matching keys, before giving up.
fr: Si vous essayez de chercher une factoid inexistante, cette option permet de faire en sorte que le bot recherche les clefs de factoids dont le nom est proche, et qu'il les affiche.

source: $key could be $value.
fr: $key semble être $value.

source: Determines the format of the response given when a factoid's value is requested. All the standard substitutes apply, in addition to "$key" for the factoid's key and "$value" for the factoid's value.
fr: Détermine le format de la réponse donnée lorsqu'une valeur de factoid est demandée. Tous les substitus standards s'appliquent, en plus de "$key" pour la clef de la factoid et "$value" pour la valeur de la factoid.

source: key
fr: clé

source: id
fr: n°

source: fact
fr: factoid

source: You have to be at least voiced to teach factoids.
fr: Vous devez au moins être voice pour m’apprendre des factoids.

source: [<channel>] <key> %s <value> Associates <key> with <value>. <channel> is only necessary if the message isn't sent on the channel itself. The word '%s' is necessary to separate the key from the value. It can be changed to another word via the learnSeparator registry value.
fr: [<canal>] <clef> %s <valeur> Associer la <clef> avec la <valeur>. <canal> n'est nécessaire que si le message n'est pas envoyé sur le canal lui-même. Le mot '%s' est nécessaire pour séparer la clef de la valeur. Il peut être modifié avec la valeur de registre learnSeparator.

source: That's not a valid number for that key.
fr: Ce n'est pas un nombre valide pour cette clef.

source: No factoid matches that key.
fr: Aucune factoid ne correspond à cette clef.

source: [<channel>] [--raw] <key> [<number>] Looks up the value of <key> in the factoid database. If given a number, will return only that exact factoid. If '--raw' option is given, no variable substitution will take place on the factoid. <channel> is only necessary if the message isn't sent in the channel itself.
fr: [<canal>] <clef> [<nombre>] Regarde la valeur de la <clef> dans la base de données de factoids. Si un <nombre> est donné, retourne la factoid exacte. Si l'option --raw est donnée, aucune substitution de variable ne sera effectuée avant d'afficher la factoid.<canal> n'est nécessaire que si le message n'est pas envoyé sur le canal lui-même.

source: key id
fr: id de clef

source: [<channel>] <oldkey> <newkey> [<number>] Adds a new key <newkey> for factoid associated with <oldkey>. <number> is only necessary if there's more than one factoid associated with <oldkey>. The same action can be accomplished by using the 'learn' function with a new key but an existing (verbatim) factoid content.
fr: [<canal>] <ancienne clef> <nouvelle clef> [<nombre>] Ajoute une <nouvelle clef> à la factoid correspondant à l'<ancienne clef>. Le <nombre> n'est nécessaire que si il y a plus d'une factoid associée à l'<ancienne clef>.La même action peut être accomplie en utilisant la fonction 'learn' avec la <nouvelle clef>, sans le contenu actuel de la factoid.

source: This key-factoid relationship already exists.
fr: Cette relation clef-factoid existe déjà.

source: This key has more than one factoid associated with it, but you have not provided a number.
fr: Cette clef a plus d'une factoid associée, mais vous n'avez pas fourni un nombre.

source: [<channel>] [--plain] [--alpha] [<number>] Returns a list of top-ranked factoid keys, sorted by usage count (rank). If <number> is not provided, the default number of factoid keys returned is set by the rankListLength registry value. If --plain option is given, rank numbers and usage counts are not included in output. If --alpha option is given in addition to --plain, keys are sorted alphabetically, instead of by rank. <channel> is only necessary if the message isn't sent in the channel itself.
fr: [<canal>] [--plain] [--alpha] [<nombre>] Retourne une liste des factoids les plus utilisées. Si le <nombre> n'est pas fourni, il correspond par défaut au nombre de clefs de factoids défini dans la clef de registre rankListLength. Si --plain est donné, le numéro des rangs et le comptage des utilisations n'est pas inclu dans la sortie. Si --alpha est donné, en plus de --plain, les clefs seront triées alphabétiquement, au lieu de l'être par leur rang.<canal> n'est nécessaire que si le message n'est pas envoyé sur le canal lui-même.

source: [<channel>] <key> Locks the factoid(s) associated with <key> so that they cannot be removed or added to. <channel> is only necessary if the message isn't sent in the channel itself.
fr: [<canal>] <clef> Verrouille la/les factoid(s) associé(e) à la <clef>, pour qu'elles ne puissent plus être supprimées ou modifiées. <canal> n'est nécessaire que si le message n'est pas envoyé sur le canal lui-même.

source: [<channel>] <key> Unlocks the factoid(s) associated with <key> so that they can be removed or added to. <channel> is only necessary if the message isn't sent in the channel itself.
fr: [<canal>] <clef> Verrouille la/les factoid(s) associé(e) à la <clef>, pour qu'elles puissent être supprimées ou modifiées. <canal> n'est nécessaire que si le message n'est pas envoyé sur le canal lui-même.

source: [<channel>] <key> [<number>|*] Removes a key-fact relationship for key <key> from the factoids database. If there is more than one such relationship for this key, a number is necessary to determine which one should be removed. A * can be used to remove all relationships for <key>. If as a result, the key (factoid) remains without any relationships to a factoid (key), it shall be removed from the database. <channel> is only necessary if the message isn't sent in the channel itself.
fr: [<canal>] <clef> [<nombre>|*] Enlève la factoid <clef> de la base de données. Si il y a plus d'une factoid avec cette clef, un <nombre> est requis pour déterminer laquelle sera supprimée. Un joker * peut être utilisé pour enlever toutes les factoids avec cette clef. Si, en tant que résultat, la clef (factoid) n'a plus aucune relation avec une autre factoid (clef), elle devrait être supprimée de la base de données.<canal> n'est nécessaire que si le message n'est pas envoyé sur le canal lui-même.

source: You have to be at least voiced to remove factoids.
fr: Vous devez au moins être voice pour supprimer des factoids.

source: There is no such factoid.
fr: Cette factoid n'existe pas.

source: Invalid factoid number.
fr: Numéro de factoid invalide.

source: %s factoids have that key. Please specify which one to remove, or use * to designate all of them.
fr: %s factoids ont cette clef. Veuillez spécifier laquelle vous voulez supprimer ou utiliser * pour toutes les désigner.

source: [<channel>] Returns random factoids from the database for <channel>. <channel> is only necessary if the message isn't sent in the channel itself.
fr: [<canal>] Retourne une factoid aléatoire de la base de données pour le canal. <canal> n'est nécessaire que si le message n'est pas envoyé sur le canal lui-même.

source: I couldn't find a factoid.
fr: Je ne peux trouver une factoid

source: [<channel>] <key> Gives information about the factoid(s) associated with <key>. <channel> is only necessary if the message isn't sent in the channel itself.
fr: [<canal>] <clef> Donne des informations sur la/les factoid(s) associée(s) à la <clef>. <canal> n'est nécessaire que si le message n'est pas envoyé sur le canal lui-même.

source: #%i was added by %s at %s, and has been recalled %n
fr: #%i a été ajouté par %s le %s, et il y a eu %n.

source: time
fr: rappel

source: [<channel>] <key> <number> <regexp> Changes the factoid #<number> associated with <key> according to <regexp>.
fr: [<canal>] <clef> <nombre> <expression régulière> Change la factoid <nombre> associée à la <clef>, en accord avec l'<expression régulière>. <canal> n'est nécessaire que si le message n'est pas envoyé sur le canal lui-même.

source: I couldn't find any key %q
fr: Je ne peux trouver de clef %q

source: [<channel>] [--values] [--{regexp} <value>] [<glob> ...] Searches the keyspace for keys matching <glob>. If --regexp is given, its associated value is taken as a regexp and matched against the keys. If --values is given, search the value space instead of the keyspace.
fr: [<canal>] [--values] [--{regexp} <expression régulière>] [<glob>...] Recherche les clefs correspondant au <glob>. Si --regexp est donné, recherche les clefs correspondantes à l'<expression régulière>. Si --values est donné, recherche parmi les valeurs, plutôt que parmi les clefs. <canal> n'est nécessaire que si le message n'est pas envoyé sur le canal lui-même.

source: No keys matched that query.
fr: Aucune clef ne correspond à cette requête.

source: More than 100 keys matched that query; please narrow your query.
fr: Plus de 100 clefs correspondent à votre requête ; veuillez la préciser.
